#-*-coding:utf-8-*-

'''
# ----------------------------------------------------------------------------
#  Purpose:     项目配置文件
#
#  Author:      半片叶
#
#  Created:     2020.08.11
#
#        _       __    _     ___   ____
#       | |\/|  / /\  \ \_/ | |_) | |_
#       |_|  | /_/--\  |_|  |_|_) |_|__
# ----------------------------------------------------------------------------
'''


# MongoDB 数据库配置
MONGODB_IP = "10.66.193.83"
MONGODB_PORT = 27017
MONGODB_USERNAME = "root"
MONGODB_PASSWORD = "maybeRootUser8866"
MONGODB_NAME = "maybe"

