#-*-coding:utf-8-*-

'''
# ----------------------------------------------------------------------------
#  Purpose:     Maybe
#
#  Author:      半片叶
#
#  Created:     2020.08.12
#
#        _       __    _     ___   ____
#       | |\/|  / /\  \ \_/ | |_) | |_
#       |_|  | /_/--\  |_|  |_|_) |_|__
# ----------------------------------------------------------------------------
'''

__title__ = 'Maybe'
__version__ = '0.0.1'
__description__ = 'API接口探索性测试平台'
__author__ = "半片叶(Half Leaf)"
__author_email__ = 'ye944205791@163.com'
__license__ = 'MIT'
__copyright__ = 'Copyright 2020-present Half Leaf'
